#!/usr/bin/env python3
# -*- coding: utf-8 -*-
#在Python中，采用的格式化方式和C语言是一致的，用%实现，举例如下：
print('hello, %s' % 'world')
#%运算符就是用来格式化字符串的。在字符串内部，%s表示用字符串替换，%d表示用整数替换，
# 有几个%?占位符，后面就跟几个变量或者值，顺序要对应好。如果只有一个%?，括号可以省略。
print('hi %s,you have $%d'%('张三',100000))
#格式化整数和浮点数还可以指定是否补0和整数与小数的位数：
print('%2d-%02d' % (3, 1))#%2d意为以固定的两位位宽来输出展示内容，不足两位在前面补空格，超过两位，则按实际位数输出
print('%.2f' % 3.1415926)
#当字符串里面的%是一个普通字符时，这个时候就需要转义，用%%来表示一个%：
print('growth rate: %d %%' % 7)
#另一种格式化字符串的方法是使用字符串的format()方法，它会用传入的参数依次替换字符串内的占位符{0}、{1}……，不过这种方式写起来比%要麻烦得多：
print('Hello, {0}, 成绩提升了 {1:.1f}%'.format('小明', 17.125))